{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report linking the viewport‑safe NoButton fix to its source file and metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend Valentine components, styles, and hooks.",
  "frontend/index.css": "Tailwind base setup defining extensive OKLCH color variables and theme tokens for light/dark modes.",
  "frontend/index.html": "Basic HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Controls the three‑screen Valentine flow, switching between opening, transition, and celebration views.",
  "frontend/src/components/valentine/constants.ts": "Defines text, emoji, and message constants for the Valentine UI screens.",
  "frontend/src/components/valentine/FinalCelebrationScreen.tsx": "Renders the final screen with floating hearts, teddy bear GIF, emoji row, and optional music playback.",
  "frontend/src/components/valentine/FireworksCanvas.tsx": "Canvas animation generating pink fireworks with rising rockets, burst rings, and particle effects.",
  "frontend/src/components/valentine/NoButton.tsx": "A moving 'No' button that randomizes its position while ensuring it stays fully within viewport bounds.",
  "frontend/src/components/valentine/OpeningScreen.tsx": "Opening screen showing the Valentine question, cycling 'No' messages, hearts animation, and buttons.",
  "frontend/src/components/valentine/PopHeartsBackground.tsx": "Animates randomly spawning hearts with timed removal, capped at eight visible at once.",
  "frontend/src/components/valentine/YesTransition.tsx": "Shows a fade‑to‑black overlay and triggers fireworks before calling onComplete after a delay.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and handling login, logout, and status.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed.",
  "frontend/src/index.css": "Tailwind base styles plus custom Valentine color variables and animation keyframes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, wrapping it in query and identity providers.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata describing requirements and an issue about constraining the “No” button to stay fully within the viewport."
}