{
  "backend/main.mo": "Empty Motoko actor placeholder with no functionality.",
  "feature_evidence.json": "Feature evidence report mapping two Valentine features to their associated frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose and behavior of all frontend files.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens.",
  "frontend/index.html": "Base HTML file loading the React app entry point.",
  "frontend/src/App.tsx": "Controls screen state transitions between opening, transition, and final celebration screens.",
  "frontend/src/components/valentine/constants.ts": "Defines static Valentine UI strings, no‑button messages, and celebration screen text.",
  "frontend/src/components/valentine/FinalCelebrationScreen.tsx": "Displays the final celebration view with floating hearts, teddy bear GIF, heart emojis, and optional music.",
  "frontend/src/components/valentine/FireworksCanvas.tsx": "Canvas component rendering pink fireworks with rising rockets, burst rings, and particle effects.",
  "frontend/src/components/valentine/NoButton.tsx": "Floating 'No' button that relocates to random on‑screen positions on each click while staying within safe viewport bounds.",
  "frontend/src/components/valentine/OpeningScreen.tsx": "Renders the main Valentine prompt with changing messages, yes/no buttons, and animated decorations.",
  "frontend/src/components/valentine/PopHeartsBackground.tsx": "Generates floating heart elements on a timed loop with a cap on concurrent hearts.",
  "frontend/src/components/valentine/YesTransition.tsx": "Shows a fade‑to‑black transition with timed fireworks before invoking a completion callback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating no backend queries are needed for this project.",
  "frontend/src/index.css": "Tailwind setup and custom animations, colors, and styles for the Valentine theme.",
  "frontend/src/main.tsx": "Bootstraps the app with React, query client, and Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, and custom settings for the Valentine UI.",
  "project_state.json": "Stores project state and requirements for fixing the Valentine page so the No button stays visible, moves on every click, and message cycling loops until Yes is pressed."
}