{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report describing a fix for keeping the Valentine 'No' button fully within the viewport.",
  "frontend-file-summaries.txt": "Text file mapping frontend paths to their descriptive summaries for quick reference.",
  "frontend/index.css": "Tailwind base layer with light/dark OKLCH color variables and global background/foreground styling.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Controls screen state transitions between opening, transition, and celebration views.",
  "frontend/src/components/valentine/constants.ts": "Provides static text, emoji sets, and message arrays for the Valentine UI screens.",
  "frontend/src/components/valentine/FinalCelebrationScreen.tsx": "Renders final celebration UI with floating hearts, teddy bear GIF, emoji row, and optional music playback.",
  "frontend/src/components/valentine/FireworksCanvas.tsx": "Canvas component rendering animated pink fireworks with burst rings and particle effects.",
  "frontend/src/components/valentine/NoButton.tsx": "Repositions the 'No' button randomly while strictly clamping it inside the visible viewport with visualViewport support.",
  "frontend/src/components/valentine/OpeningScreen.tsx": "Opening screen with name, question, Yes/No buttons, and auto-cycling 'No' messages after first click.",
  "frontend/src/components/valentine/PopHeartsBackground.tsx": "Renders floating pop-in hearts that spawn at random positions with timed lifetimes and a cap on simultaneous hearts.",
  "frontend/src/components/valentine/YesTransition.tsx": "Displays a fade-to-black transition and triggers fireworks before calling a completion callback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for managing authentication, identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing for this frontend-only project.",
  "frontend/src/index.css": "Defines Tailwind base styles, Valentine-themed color variables, fonts, and keyframe animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Describes project state and requirements, including fixing the off-screen 'No' button bug."
}