{
  "kind": "build_request",
  "title": "Fix “No” button to stay fully within the visible viewport at all times",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Valentine Opening Screen “No” button movement so the button’s rendered bounding box always remains completely within the visible viewport (no partial off-screen placement). Random repositioning must be strictly constrained within the viewport boundaries and must properly account for the button’s current width/height and dynamic viewport changes (resize/orientation/zoom/mobile browser UI). The button must remain fully visible and clickable at all times while still moving playfully and randomly within the safe area. Keep everything else unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The “No” button is still going off-screen and outside the visible frame. This issue needs to be properly fixed.",
          "Stay fully inside the visible viewport at all times.",
          "Properly account for the button’s width and height when calculating its random position so it cannot overflow the edges.",
          "Everything else is perfect and should remain unchanged."
        ]
      },
      "acceptanceCriteria": [
        "When the user clicks the “No” button, its new position is always fully visible (no clipping on any edge) and fully clickable.",
        "Random positions are computed using safe bounds that subtract the button’s current rendered width and height from the available viewport area, with a consistent padding/margin.",
        "The computation correctly handles mobile/visual viewport scenarios (e.g., browser UI showing/hiding, zoom, orientation changes) so the button never appears partially outside the visible frame.",
        "On any viewport change events (resize/orientation/visualViewport resize/scroll), the current position is re-clamped so the button remains fully inside the visible viewport without jumping off-screen.",
        "No other UI behavior, text, styling, or screen flow is changed aside from the “No” button staying within bounds."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not change any behavior or styling outside the “No” button viewport-safe positioning fix.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new screens, messages, animations, or changing the Valentine flow.",
    "Backend changes (Motoko actor logic) or persistence."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}