{
  "kind": "build_request",
  "title": "Fully constrain “No” button random movement to always stay inside viewport",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Valentine Opening Screen “No” button movement so the button’s rendered bounding box always remains completely within the visible viewport (no partial off-screen placement), accounting for the button’s current width/height and any dynamic viewport changes (resize/orientation/zoom/mobile browser UI). The button must remain fully visible and clickable at all times, and every random reposition must be strictly constrained within the viewport boundaries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages.user-1"
        ],
        "quotes": [
          "It sometimes moves partially or completely off-screen, making it unclickable.",
          "The “No” button always stays completely within the visible screen boundaries.",
          "It never moves outside the viewport (not horizontally or vertically).",
          "Its random movement is strictly constrained within the screen frame, taking button size into account."
        ]
      },
      "acceptanceCriteria": [
        "After any number of consecutive clicks (e.g., 200+), the “No” button never becomes partially or fully off-screen and is always clickable.",
        "On window resize and mobile orientation changes, the “No” button is clamped/repositioned as needed so the full button stays within the visible viewport.",
        "Random positions are generated using safe min/max bounds derived from the current viewport size and the current button dimensions (width/height), ensuring left >= 0+padding, top >= 0+padding, and (left+buttonWidth) <= viewportWidth-padding and (top+buttonHeight) <= viewportHeight-padding.",
        "The fix does not change any other behavior, styling, text, message cycling, or screen flow."
      ]
    }
  ],
  "constraints": [
    "Do not make any other UI/behavior changes beyond fixing the “No” button off-screen issue.",
    "Do not edit any files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep the app frontend-only; no backend changes are required for this fix."
  ],
  "nonGoals": [
    "Adding new screens, animations, or altering the existing Valentine theme.",
    "Changing the “Yes” button behavior or message cycling logic.",
    "Introducing backend state, persistence, or authentication changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}